; domain
(define (domain logistics-strips)
  (:requirements :strips :constraints)
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c8-s2-p7-a5)
(:domain logistics-strips)
(:objects a0 a1 a2 a3 a4 
          c0 c1 c2 c3 c4 c5 c6 c7 
          t0 t1 t2 t3 t4 t5 t6 t7 
          l0-0 l0-1 l1-0 l1-1 l2-0 l2-1 l3-0 l3-1 l4-0 l4-1 l5-0 l5-1 l6-0 l6-1 l7-0 l7-1 
          p0 p1 p2 p3 p4 p5 p6 
)
(:init
    (AIRPLANE a0)
    (AIRPLANE a1)
    (AIRPLANE a2)
    (AIRPLANE a3)
    (AIRPLANE a4)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (CITY c3)
    (CITY c4)
    (CITY c5)
    (CITY c6)
    (CITY c7)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (TRUCK t3)
    (TRUCK t4)
    (TRUCK t5)
    (TRUCK t6)
    (TRUCK t7)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l3-0)
    (in-city  l3-0 c3)
    (LOCATION l3-1)
    (in-city  l3-1 c3)
    (LOCATION l4-0)
    (in-city  l4-0 c4)
    (LOCATION l4-1)
    (in-city  l4-1 c4)
    (LOCATION l5-0)
    (in-city  l5-0 c5)
    (LOCATION l5-1)
    (in-city  l5-1 c5)
    (LOCATION l6-0)
    (in-city  l6-0 c6)
    (LOCATION l6-1)
    (in-city  l6-1 c6)
    (LOCATION l7-0)
    (in-city  l7-0 c7)
    (LOCATION l7-1)
    (in-city  l7-1 c7)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (AIRPORT l3-0)
    (AIRPORT l4-0)
    (AIRPORT l5-0)
    (AIRPORT l6-0)
    (AIRPORT l7-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (at t0 l0-0)
    (at t1 l1-0)
    (at t2 l2-0)
    (at t3 l3-1)
    (at t4 l4-0)
    (at t5 l5-1)
    (at t6 l6-1)
    (at t7 l7-0)
    (at p0 l5-0)
    (at p1 l4-1)
    (at p2 l2-1)
    (at p3 l1-1)
    (at p4 l2-0)
    (at p5 l1-0)
    (at p6 l7-0)
    (at a0 l5-0)
    (at a1 l4-0)
    (at a2 l4-0)
    (at a3 l3-0)
    (at a4 l0-0)
)
(:goal
    (and
        (at p0 l1-1)
        (at p1 l0-1)
        (at p2 l1-0)
        (at p3 l6-0)
        (at p4 l5-0)
        (at p5 l4-0)
        (at p6 l5-0)
    )
)

  (:constraints
    (always (not (at p0 l0-0)))
  )
)

; plan
1. (load-airplane p0 a0 l5-0)
   deleted: (at p0 l5-0)
   added: (in p0 a0)
   goals met: 0 of 7
2. (drive-truck t4 l4-0 l4-1 c4)
   deleted: (at t4 l4-0)
   added: (at t4 l4-1)
   goals met: 0 of 7
3. (drive-truck t2 l2-0 l2-1 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-1)
   goals met: 0 of 7
4. (drive-truck t1 l1-0 l1-1 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 0 of 7
5. (fly-airplane a2 l4-0 l1-0)
   deleted: (at a2 l4-0)
   added: (at a2 l1-0)
   goals met: 0 of 7
6. (fly-airplane a3 l3-0 l7-0)
   deleted: (at a3 l3-0)
   added: (at a3 l7-0)
   goals met: 0 of 7
7. (fly-airplane a4 l0-0 l7-0)
   deleted: (at a4 l0-0)
   added: (at a4 l7-0)
   goals met: 0 of 7
8. (load-truck p1 t4 l4-1)
   deleted: (at p1 l4-1)
   added: (in p1 t4)
   goals met: 0 of 7
9. (load-truck p2 t2 l2-1)
   deleted: (at p2 l2-1)
   added: (in p2 t2)
   goals met: 0 of 7
10. (load-truck p3 t1 l1-1)
   deleted: (at p3 l1-1)
   added: (in p3 t1)
   goals met: 0 of 7
11. (fly-airplane a0 l5-0 l1-0)
   deleted: (at a0 l5-0)
   added: (at a0 l1-0)
   goals met: 0 of 7
12. (load-airplane p6 a3 l7-0)
   deleted: (at p6 l7-0)
   added: (in p6 a3)
   goals met: 0 of 7
13. (fly-airplane a4 l7-0 l5-0)
   deleted: (at a4 l7-0)
   added: (at a4 l5-0)
   goals met: 0 of 7
14. (drive-truck t4 l4-1 l4-0 c4)
   deleted: (at t4 l4-1)
   added: (at t4 l4-0)
   goals met: 0 of 7
15. (drive-truck t2 l2-1 l2-0 c2)
   deleted: (at t2 l2-1)
   added: (at t2 l2-0)
   goals met: 0 of 7
16. (drive-truck t1 l1-1 l1-0 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 0 of 7
17. (unload-airplane p0 a0 l1-0)
   deleted: (in p0 a0)
   added: (at p0 l1-0)
   goals met: 0 of 7
18. (fly-airplane a3 l7-0 l5-0)
   deleted: (at a3 l7-0)
   added: (at a3 l5-0)
   goals met: 0 of 7
19. (fly-airplane a4 l5-0 l2-0)
   deleted: (at a4 l5-0)
   added: (at a4 l2-0)
   goals met: 0 of 7
20. (unload-truck p1 t4 l4-0)
   deleted: (in p1 t4)
   added: (at p1 l4-0)
   goals met: 0 of 7
21. (unload-truck p2 t2 l2-0)
   deleted: (in p2 t2)
   added: (at p2 l2-0)
   goals met: 0 of 7
22. (unload-truck p3 t1 l1-0)
   deleted: (in p3 t1)
   added: (at p3 l1-0)
   goals met: 0 of 7
23. (fly-airplane a0 l1-0 l6-0)
   deleted: (at a0 l1-0)
   added: (at a0 l6-0)
   goals met: 0 of 7
24. (load-truck p0 t1 l1-0)
   deleted: (at p0 l1-0)
   added: (in p0 t1)
   goals met: 0 of 7
25. (unload-airplane p6 a3 l5-0)
   deleted: (in p6 a3)
   added: (at p6 l5-0)
   goals met: 1 of 7
26. (load-airplane p4 a4 l2-0)
   deleted: (at p4 l2-0)
   added: (in p4 a4)
   goals met: 1 of 7
27. (drive-truck t1 l1-0 l1-1 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 1 of 7
28. (load-airplane p1 a1 l4-0)
   deleted: (at p1 l4-0)
   added: (in p1 a1)
   goals met: 1 of 7
29. (load-airplane p3 a2 l1-0)
   deleted: (at p3 l1-0)
   added: (in p3 a2)
   goals met: 1 of 7
30. (load-airplane p2 a4 l2-0)
   deleted: (at p2 l2-0)
   added: (in p2 a4)
   goals met: 1 of 7
31. (fly-airplane a3 l5-0 l1-0)
   deleted: (at a3 l5-0)
   added: (at a3 l1-0)
   goals met: 1 of 7
32. (fly-airplane a1 l4-0 l0-0)
   deleted: (at a1 l4-0)
   added: (at a1 l0-0)
   goals met: 1 of 7
33. (unload-truck p0 t1 l1-1)
   deleted: (in p0 t1)
   added: (at p0 l1-1)
   goals met: 2 of 7
34. (fly-airplane a2 l1-0 l6-0)
   deleted: (at a2 l1-0)
   added: (at a2 l6-0)
   goals met: 2 of 7
35. (fly-airplane a4 l2-0 l5-0)
   deleted: (at a4 l2-0)
   added: (at a4 l5-0)
   goals met: 2 of 7
36. (load-airplane p5 a3 l1-0)
   deleted: (at p5 l1-0)
   added: (in p5 a3)
   goals met: 2 of 7
37. (unload-airplane p1 a1 l0-0)
   deleted: (in p1 a1)
   added: (at p1 l0-0)
   goals met: 2 of 7
38. (unload-airplane p3 a2 l6-0)
   deleted: (in p3 a2)
   added: (at p3 l6-0)
   goals met: 3 of 7
39. (fly-airplane a3 l1-0 l4-0)
   deleted: (at a3 l1-0)
   added: (at a3 l4-0)
   goals met: 3 of 7
40. (unload-airplane p4 a4 l5-0)
   deleted: (in p4 a4)
   added: (at p4 l5-0)
   goals met: 4 of 7
41. (load-truck p1 t0 l0-0)
   deleted: (at p1 l0-0)
   added: (in p1 t0)
   goals met: 4 of 7
42. (fly-airplane a4 l5-0 l1-0)
   deleted: (at a4 l5-0)
   added: (at a4 l1-0)
   goals met: 4 of 7
43. (unload-airplane p5 a3 l4-0)
   deleted: (in p5 a3)
   added: (at p5 l4-0)
   goals met: 5 of 7
44. (drive-truck t0 l0-0 l0-1 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 5 of 7
45. (unload-airplane p2 a4 l1-0)
   deleted: (in p2 a4)
   added: (at p2 l1-0)
   goals met: 6 of 7
46. (unload-truck p1 t0 l0-1)
   deleted: (in p1 t0)
   added: (at p1 l0-1)
   goals met: 7 of 7
